RULES = dict([
    ('ং', 's'),
    ('ঃ', 't'),
    ('অ', 'A'),
    ('আ', 'Av'),
    ('ই', 'B'),
    ('ঈ', 'C'),
    ('উ', 'D'),
    ('ঊ', 'E'),
    ('ঋ', 'F'),
    ('এ', 'G'),
    ('ঐ', 'H'),
    ('ও', 'I'),
    ('ঔ', 'J'),
    ('ক', 'K'),
    ('খ', 'L'),
    ('গ', 'M'),
    ('ঘ', 'N'),
    ('ঙ', 'O'),
    ('চ', 'P'),
    ('ছ', 'Q'),
    ('জ', 'R'),
    ('ঝ', 'S'),
    ('ঞ', 'T'),
    ('ট', 'U'),
    ('ঠ', 'V'),
    ('ড', 'W'),
    ('ঢ', 'X'),
    ('ণ', 'Y'),
    ('ত', 'Z'),
    ('থ', '_'),
    ('দ', '`'),
    ('ধ', 'a'),
    ('ন', 'b'),
    ('প', 'c'),
    ('ফ', 'd'),
    ('ব', 'e'),
    ('ভ', 'f'),
    ('ম', 'g'),
    ('য', 'h'),
    ('র', 'i'),
    ('ল', 'j'),
    ('শ', 'k'),
    ('ষ', 'l'),
    ('স', 'm'),
    ('হ', 'n'),
    ('া', 'vw'),
    ('ি', 'w'),
    ('ী', 'x')
])


def from_unicode(s: str) -> str:
    if '০' <= s <= '৯':
        return chr(ord(s) - 2486)

    if s in RULES:
        return RULES[s]

    raise NotImplementedError
